Repository: kaochen/C_SDL_GAME
Catalog: po/*.po
Languages: fr

source: Verbose mode is on
fr: Mode verbeux activé

source: SDL initialization error: %s
fr: SDL initialization erreur: %s

source: TTF_Init initialization error: %s
fr: TTF_Init initialization erreur: %s

source: Current directory %s
fr: Dossier courant %s

source: The window size request from settings is %dx%d
fr: La taille de la fenêtre demandé dans les préferences est de %dx%d

source: SDL_CreateWindow failed: %s
fr: SDL_CreateWindow a échoué : %s

source: Game icon path: %s
fr: Chemin de l'icône du jeu : %s

source: SDL_GetWindowSurface failed: %s
fr: SDL_GetWindowSurface a échoué : %s

source: The SDL window has been created.
fr: La fenêtre SDL a été créée.

source: The level files cannot be listed from the folder %s.
fr: Impossible de lister les fichier de niveau depuis le dossier %s.

source: The level list cannot be verified.
fr: La liste des niveaux ne peut être vérifié

source: Error when loading levels attributs from files.
fr: Erreur lors du chargement des attributs des niveaux depuis les fichier.

source: Loading first level.
fr: Chargement du premier niveau.

source: Cannot load the first level.
fr: Impossible de charger le premier niveau.

source: first displayLevel() failed.
fr: Le permier displayLevel() a échoué.

source: first displayTopBar() failed.
fr: Le premier displayTopBar() a échoué.

source: Impossible to load the level. Perror
fr: Impossible de charger le niveau. Perror

source: displayTopBar() failed.
fr: displayTopBar() a échoué.

source: Destroying level list
fr: Destruction de la liste des niveaux

source: Destroying file list
fr: Destruction de la liste des fichiers

source: Bye
fr: Au revoir

source: The level files cannot from the folder levels/ be listed.
fr: Impossible de lister les fichiers contenant les niveaux depuis le dossier levels/.

source: The list of the possible levels has been generate from the content of the folder levels/.
fr: La liste des niveaux possible a été généré à partir du contenu du dossier levels/.

source: Level loaded.
fr: Niveau chargé.

source: not enough memory
fr: pas assez de mémoire

source: Level: %d/%d
fr: Niveau : %d/%d

source: The font file %s was not found.
fr: Impossible de trouver le fichier %s.

source: CONGRATS!!!
fr: FELICITATION!!!

source: Current Level Infos
fr: Information sur le niveau actuel

source: Shortcuts
fr: Raccourcis

source: About
fr: A propos

source: Name:
fr: Nom :

source: File:
fr: Fichier :

source: File: %s...
fr: Fichier : %s...

source: File: %s
fr: Fichier : %s

source: Authors:
fr: Auteurs :

source: m : open and close menu
fr: m : ouvrir et fermer le menu

source: n : next level
fr: n : niveau suivant

source: p : previous level
fr: p : niveau précédent

source: r : reset current level
fr: r : remet à zéro le niveau actuel

source: q : quit game
fr: q : quitter le jeu

source: the file %s does not exist
fr: Le fichier %s n'existe pas

source: Load default image instead: %s
fr: Chargement de l'image par défaut à la place : %s

source: %s exist
fr: %s existe

source: IMG_Load %s failed: %s
fr: IMG_Load %s a échoué : %s

source: All surfaces are free %s
fr: Toutes les surfaces ont été libéré %s
